---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotSlopeLeaderLength
source: html/e0bb23b1-821a-85d1-4fe9-c0d27f78f5a7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotSlopeLeaderLength Property

"Leader Line Length"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotSlopeLeaderLength { get; }
```